lvx/extension/InformationRegisters/бит_СтруктурыХраненияУпаковок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СтруктурыХраненияУпаковок</Name>
			<Comment>ЛТ6.3 [Микляев К.А.]</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СодержимоеУпаковкиПФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлинаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШиринаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаМм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МассаКг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемМ3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВсегоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бит_СерииСгенерированы</Name>
					<Comment>ЛТ 6.7</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>бит_ГруппировкиПечатиБегунков</Name>
					<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АгрегированнаяНоменклатура</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СигнатураСостава</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распечатано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>бит_СоставГруппировокПечатиБегунков</Name>
					<Comment>ЛТ6.9 [Микляев К.А.]</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиПродукции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/extension/CommonModules/бит_ПечатьЭтикетокГПСервер/Ext/Module.bsl
// {{ПервыйБИТ Лист требований [ЛТ6.8] [Микляев К.А.] [15.07.2026] +

#Область ПрограммныйИнтерфейс

// Возвращает строки продукции заказа, для которых в регистре "Структуры хранения упаковок"
// нет записей - по ним количество упаковок пользователь указывает вручную перед печатью.
//
// Параметры:
//   СсылкаЗаказа - ДокументСсылка.ЗаказНаПроизводство2_2 - заказ на производство.
//   ВыделенныеСтроки - Массив из Число, Неопределено - номера строк ТЧ "Продукция";
//                      Неопределено - все строки заказа.
//
// Возвращаемое значение:
//   ТаблицаЗначений - колонки НомерСтроки, Номенклатура, Характеристика, КоличествоУпаковок.
//
Функция СтрокиБезСтруктурыУпаковок(СсылкаЗаказа, ВыделенныеСтроки = Неопределено) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПродукцияЗаказа.НомерСтроки КАК НомерСтроки,
	                      |	ПродукцияЗаказа.Номенклатура КАК Номенклатура,
	                      |	ПродукцияЗаказа.Характеристика КАК Характеристика,
	                      |	0 КАК КоличествоУпаковок
	                      |ИЗ
	                      |	Документ.ЗаказНаПроизводство2_2.Продукция КАК ПродукцияЗаказа
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СтруктурыХраненияУпаковок КАК СтруктурыУпаковок
	                      |		ПО ПродукцияЗаказа.Номенклатура = СтруктурыУпаковок.Номенклатура
	                      |ГДЕ
	                      |	ПродукцияЗаказа.Ссылка = &СсылкаЗаказа
	                      |	И СтруктурыУпаковок.Номенклатура ЕСТЬ NULL
	                      |	И (&ВсеСтроки
	                      |			ИЛИ ПродукцияЗаказа.НомерСтроки В (&ВыделенныеСтроки))
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСтроки");
	Запрос.УстановитьПараметр("СсылкаЗаказа", СсылкаЗаказа);
	Запрос.УстановитьПараметр("ВсеСтроки", ВыделенныеСтроки = Неопределено);
	Запрос.УстановитьПараметр("ВыделенныеСтроки",
		?(ВыделенныеСтроки = Неопределено, Новый Массив, ВыделенныеСтроки));

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Формирует табличный документ с этикетками готовой продукции.
//
// Параметры:
//   МассивОбъектов - Массив из ДокументСсылка.ЗаказНаПроизводство2_2 - печатаемые заказы.
//   ПараметрыПечати - Структура - дополнительные параметры команды печати:
//     * бит_КоличествоУпаковок - Массив из Структура - введенные пользователем данные
//                                (НомерСтроки, Номенклатура, Характеристика, КоличествоУпаковок).
//     * бит_ВыделенныеСтроки - Массив из Число - номера строк ТЧ "Продукция" для печати.
//
// Возвращаемое значение:
//   ТабличныйДокумент - комплекты этикеток.
//
Функция СформироватьПечатнуюФормуЭтикеток(МассивОбъектов, ПараметрыПечати) Экспорт

	ВыделенныеСтроки = Неопределено;
	Если ПараметрыПечати <> Неопределено Тогда
		ПараметрыПечати.Свойство("бит_ВыделенныеСтроки", ВыделенныеСтроки);
	КонецЕсли;

	КоличествоУпаковокВручную = КоличествоУпаковокВручнуюПоКлючам(ПараметрыПечати);

	// Для строк без штрихкода он создается типовой генерацией и сразу пишется в регистр,
	// чтобы попасть в печатную форму.
	ОбеспечитьШтрихкоды(МассивОбъектов, ВыделенныеСтроки);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_бит_ЭтикеткаГотовойПродукции";
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСнизу = 0;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ПолеСправа = 0;
	ТабличныйДокумент.РазмерСтраницы = "Custom";
	ТабличныйДокумент.ШиринаСтраницы = 100;
	ТабличныйДокумент.ВысотаСтраницы = 50;

	Макет = ПолучитьОбщийМакет("бит_ПФ_ЭтикеткаГП");

	ДанныеЭтикеток = ДанныеДляЭтикеток(МассивОбъектов, ВыделенныеСтроки);
	СтруктурыУпаковок = СтруктурыУпаковокПоНоменклатуре(ДанныеЭтикеток.ВыгрузитьКолонку("Номенклатура"));

	ПерваяЭтикетка = Истина;

	Для Каждого СтрокаПродукции Из ДанныеЭтикеток Цикл

		Упаковки = УпаковкиСтроки(СтрокаПродукции, СтруктурыУпаковок, КоличествоУпаковокВручную);
		Если Упаковки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		// На каждую единицу готовой продукции печатается свой комплект этикеток.
		КоличествоЕдиниц = Цел(СтрокаПродукции.Количество);

		Для НомерЕдиницы = 1 По КоличествоЕдиниц Цикл
			Для Каждого Упаковка Из Упаковки Цикл

				Если Не ПерваяЭтикетка Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				ПерваяЭтикетка = Ложь;

				ВывестиЭтикетку(ТабличныйДокумент, Макет, СтрокаПродукции, Упаковка);

			КонецЦикла;
		КонецЦикла;

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиЭтикетку(ТабличныйДокумент, Макет, СтрокаПродукции, Упаковка)

	ОбластьМакета = Макет.ПолучитьОбласть("Этикетка");

	ОбластьМакета.Параметры.НаименованиеГП = СтрокаПродукции.НаименованиеНоменклатуры;
	ОбластьМакета.Параметры.ХарактеристикаГП = СтрокаПродукции.НаименованиеХарактеристики;
	ОбластьМакета.Параметры.АртГПАртХар = АртикулИКодХарактеристики(СтрокаПродукции);
	ОбластьМакета.Параметры.НомерЗаказаГП = СтрокаПродукции.НомерЗаказа;
	ОбластьМакета.Параметры.НомерУпаковки = СтрШаблон("%1/%2", Упаковка.Номер, Упаковка.Всего);
	ОбластьМакета.Параметры.ШтрихКодПФ = СтрокаПродукции.Штрихкод;

	КартинкаШтрихкода = КартинкаШтрихкода(СтрокаПродукции.Штрихкод);
	Если КартинкаШтрихкода <> Неопределено Тогда
		Рисунок = ОбластьМакета.Рисунки.ШтрихКод;
		Рисунок.Картинка = КартинкаШтрихкода;
		// Убираем рамку рисунка - требование по оформлению этикетки.
		Рисунок.ГраницаСверху = Ложь;
		Рисунок.ГраницаСнизу = Ложь;
		Рисунок.ГраницаСлева = Ложь;
		Рисунок.ГраницаСправа = Ложь;
		// Картинка уже содержит подпись штрихкода - дублировать его текстом не нужно.
		ОбластьМакета.Параметры.ШтрихКодПФ = "";
	КонецЕсли;

	ТабличныйДокумент.Вывести(ОбластьМакета);

КонецПроцедуры

// Формирует значение поля "Арт." этикетки: артикул номенклатуры (или ее код, если артикул
// не заполнен) и код характеристики через "/".
//
Функция АртикулИКодХарактеристики(СтрокаПродукции)

	Если ЗначениеЗаполнено(СтрокаПродукции.Артикул) Тогда
		ЛеваяЧасть = СокрЛП(СтрокаПродукции.Артикул);
	Иначе
		ЛеваяЧасть = СокрЛП(СтрокаПродукции.КодНоменклатуры);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтрокаПродукции.КодХарактеристики) Тогда
		Возврат ЛеваяЧасть;
	КонецЕсли;

	Возврат СтрШаблон("%1/%2", ЛеваяЧасть, Формат(СтрокаПродукции.КодХарактеристики, "ЧГ=0"));

КонецФункции

Функция КартинкаШтрихкода(Штрихкод)

	Если Не ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
		ПараметрыШтрихкода.Штрихкод = СокрЛП(Штрихкод);
		ПараметрыШтрихкода.Ширина = 300;
		ПараметрыШтрихкода.Высота = 90;
		ПараметрыШтрихкода.ОтображатьТекст = Истина;
		ПараметрыШтрихкода.РазмерШрифта = 10;

		РезультатГенерации = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
		Если РезультатГенерации <> Неопределено И РезультатГенерации.Результат Тогда
			Возврат РезультатГенерации.Картинка;
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("Печать этикеток ГП (ЛТ6.8)",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат Неопределено;

КонецФункции

// Возвращает упаковки комплекта для строки продукции: по регистру "Структуры хранения упаковок",
// а при отсутствии записей - по количеству, введенному пользователем перед печатью.
//
Функция УпаковкиСтроки(СтрокаПродукции, СтруктурыУпаковок, КоличествоУпаковокВручную)

	Результат = Новый Массив;

	УпаковкиНоменклатуры = СтруктурыУпаковок.Получить(СтрокаПродукции.Номенклатура);

	Если УпаковкиНоменклатуры <> Неопределено И УпаковкиНоменклатуры.Количество() > 0 Тогда
		Для Каждого Упаковка Из УпаковкиНоменклатуры Цикл
			Результат.Добавить(Новый Структура("Номер, Всего", Упаковка.Номер, Упаковка.Всего));
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;

	КлючСтроки = КлючСтрокиПродукции(СтрокаПродукции.Номенклатура, СтрокаПродукции.Характеристика);
	ВсегоУпаковок = КоличествоУпаковокВручную.Получить(КлючСтроки);

	Если Не ЗначениеЗаполнено(ВсегоУпаковок) Тогда
		Возврат Результат;
	КонецЕсли;

	Для НомерУпаковки = 1 По ВсегоУпаковок Цикл
		Результат.Добавить(Новый Структура("Номер, Всего", НомерУпаковки, ВсегоУпаковок));
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция КоличествоУпаковокВручнуюПоКлючам(ПараметрыПечати)

	Результат = Новый Соответствие;

	Если ПараметрыПечати = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	ВведенныеДанные = Неопределено;
	Если Не ПараметрыПечати.Свойство("бит_КоличествоУпаковок", ВведенныеДанные)
		Или ВведенныеДанные = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Для Каждого ДанныеСтроки Из ВведенныеДанные Цикл
		КлючСтроки = КлючСтрокиПродукции(ДанныеСтроки.Номенклатура, ДанныеСтроки.Характеристика);
		Результат.Вставить(КлючСтроки, ДанныеСтроки.КоличествоУпаковок);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция КлючСтрокиПродукции(Номенклатура, Характеристика)

	Возврат СтрШаблон("%1|%2", Строка(Номенклатура), Строка(Характеристика));

КонецФункции

// Читает структуры хранения упаковок по номенклатуре одним запросом.
//
// Возвращаемое значение:
//   Соответствие - ключ: СправочникСсылка.Номенклатура, значение: Массив из Структура (Номер, Всего).
//
Функция СтруктурыУпаковокПоНоменклатуре(МассивНоменклатуры)

	Результат = Новый Соответствие;

	Если МассивНоменклатуры.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтруктурыУпаковок.Номенклатура КАК Номенклатура,
	                      |	СтруктурыУпаковок.НомерУпаковки КАК НомерУпаковки,
	                      |	СтруктурыУпаковок.ВсегоУпаковок КАК ВсегоУпаковок
	                      |ИЗ
	                      |	РегистрСведений.бит_СтруктурыХраненияУпаковок КАК СтруктурыУпаковок
	                      |ГДЕ
	                      |	СтруктурыУпаковок.Номенклатура В (&МассивНоменклатуры)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Номенклатура,
	                      |	НомерУпаковки");
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		УпаковкиНоменклатуры = Результат.Получить(Выборка.Номенклатура);
		Если УпаковкиНоменклатуры = Неопределено Тогда
			УпаковкиНоменклатуры = Новый Массив;
			Результат.Вставить(Выборка.Номенклатура, УпаковкиНоменклатуры);
		КонецЕсли;

		УпаковкиНоменклатуры.Добавить(Новый Структура("Номер, Всего",
			Выборка.НомерУпаковки, Выборка.ВсегоУпаковок));

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Для строк продукции без штрихкода формирует штрихкод типовой генерацией (EAN13) и пишет
// его в регистр "Штрихкоды номенклатуры" в разрезе Номенклатура + Характеристика + Упаковка.
//
Процедура ОбеспечитьШтрихкоды(МассивОбъектов, ВыделенныеСтроки)

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ПродукцияЗаказа.Номенклатура КАК Номенклатура,
	                      |	ПродукцияЗаказа.Характеристика КАК Характеристика,
	                      |	ПродукцияЗаказа.Упаковка КАК Упаковка
	                      |ИЗ
	                      |	Документ.ЗаказНаПроизводство2_2.Продукция КАК ПродукцияЗаказа
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	                      |		ПО ПродукцияЗаказа.Номенклатура = Штрихкоды.Номенклатура
	                      |			И ПродукцияЗаказа.Характеристика = Штрихкоды.Характеристика
	                      |			И ПродукцияЗаказа.Упаковка = Штрихкоды.Упаковка
	                      |ГДЕ
	                      |	ПродукцияЗаказа.Ссылка В (&МассивОбъектов)
	                      |	И Штрихкоды.Номенклатура ЕСТЬ NULL
	                      |	И (&ВсеСтроки
	                      |			ИЛИ ПродукцияЗаказа.НомерСтроки В (&ВыделенныеСтроки))");
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВсеСтроки", ВыделенныеСтроки = Неопределено);
	Запрос.УстановитьПараметр("ВыделенныеСтроки",
		?(ВыделенныеСтроки = Неопределено, Новый Массив, ВыделенныеСтроки));

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл

			Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодEAN13();
			Если Не ЗначениеЗаполнено(Штрихкод) Тогда
				// Диапазоны штучных штрихкодов не настроены - строка останется без штрихкода.
				Продолжить;
			КонецЕсли;

			МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Штрихкод = Штрихкод;
			МенеджерЗаписи.Номенклатура = Выборка.Номенклатура;
			МенеджерЗаписи.Характеристика = Выборка.Характеристика;
			МенеджерЗаписи.Упаковка = Выборка.Упаковка;
			МенеджерЗаписи.Записать();

		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("Печать этикеток ГП (ЛТ6.8)",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Собирает данные строк продукции заказов: реквизиты номенклатуры и характеристики,
// номер заказа на производство и штрихкод (по номенклатуре, характеристике и упаковке).
//
Функция ДанныеДляЭтикеток(МассивОбъектов, ВыделенныеСтроки)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПродукцияЗаказа.Ссылка КАК Заказ,
	                      |	ПродукцияЗаказа.Ссылка.Номер КАК НомерЗаказа,
	                      |	ПродукцияЗаказа.НомерСтроки КАК НомерСтроки,
	                      |	ПродукцияЗаказа.Номенклатура КАК Номенклатура,
	                      |	ПродукцияЗаказа.Характеристика КАК Характеристика,
	                      |	ПродукцияЗаказа.Количество КАК Количество,
	                      |	ПродукцияЗаказа.Номенклатура.Наименование КАК НаименованиеНоменклатуры,
	                      |	ПродукцияЗаказа.Номенклатура.Артикул КАК Артикул,
	                      |	ПродукцияЗаказа.Номенклатура.Код КАК КодНоменклатуры,
	                      |	ПродукцияЗаказа.Характеристика.Наименование КАК НаименованиеХарактеристики,
	                      |	ПродукцияЗаказа.Характеристика.бит_КодХарактеристики КАК КодХарактеристики,
	                      |	ЕСТЬNULL(Штрихкоды.Штрихкод, """") КАК Штрихкод
	                      |ИЗ
	                      |	Документ.ЗаказНаПроизводство2_2.Продукция КАК ПродукцияЗаказа
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	                      |		ПО ПродукцияЗаказа.Номенклатура = Штрихкоды.Номенклатура
	                      |			И ПродукцияЗаказа.Характеристика = Штрихкоды.Характеристика
	                      |			И ПродукцияЗаказа.Упаковка = Штрихкоды.Упаковка
	                      |ГДЕ
	                      |	ПродукцияЗаказа.Ссылка В (&МассивОбъектов)
	                      |	И (&ВсеСтроки
	                      |			ИЛИ ПродукцияЗаказа.НомерСтроки В (&ВыделенныеСтроки))
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Заказ,
	                      |	НомерСтроки");
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВсеСтроки", ВыделенныеСтроки = Неопределено);
	Запрос.УстановитьПараметр("ВыделенныеСтроки",
		?(ВыделенныеСтроки = Неопределено, Новый Массив, ВыделенныеСтроки));

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти

// }}ПервыйБИТ Лист требований [ЛТ6.8] [Микляев К.А.] [15.07.2026] -
